Обработки/Reports/_СтоимостьЧистыхАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_СтоимостьЧистыхАктивов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДоговоровДоверительногоУправления</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_СтоимостьЧистыхАктивов/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Стоимость чистых активов",
		"0.07",
		"",
		Истина);
		
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура СформироватьОтчет(Результат, Расшифровка) Экспорт
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СформироватьОтчет()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,ВидыДоговоровДоверительногоУправления");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Если Ложь Тогда
		Результат = Новый ТабличныйДокумент;
		Расшифровка = Новый ТабличныйДокумент;
	КонецЕсли;
	
	Результат.Очистить();
	Расшифровка.Очистить();
	
	Макет = ЭтотОбъект.ПолучитьМакет(ЭтотОбъект.ВариантОтчета);
	
	ОбластьШапка				= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаРасшифровки		= Макет.ПолучитьОбласть("ШапкаРасшифровки");
	ОбластьСтрокаВидДоговора	= Макет.ПолучитьОбласть("СтрокаВидДоговора");
	ОбластьСтрокаСчетДУ			= Макет.ПолучитьОбласть("СтрокаСчетДУ");
	ОбластьИтог					= Макет.ПолучитьОбласть("Итог");
	ОбластьПустаяСтрока			= Макет.ПолучитьОбласть("ПустаяСтрока");

	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"								, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаНачала"								, ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"							, ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ВидыДоговоровДоверительногоУправления"	, ПолучитьМассивВидыДоговоровДоверительногоУправления());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В(&ВидыДоговоровДоверительногоУправления)
		|	И (СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаНачала
		|				И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &ДатаНачала)
		|			ИЛИ СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаОкончания
		|				И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &ДатаОкончания))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Периоды.Период КАК Период,
		|	МАКСИМУМ(ДанныеКалендаря.Дата) КАК ПоследнийРабочийДень
		|ПОМЕСТИТЬ _Периоды
		|ИЗ
		|	(ВЫБРАТЬ
		|		&ДатаНачала КАК Период
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		&ДатаОкончания) КАК Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ПО (ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|			И (ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
		|			И (ДанныеКалендаря.Дата <= Периоды.Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	Периоды.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаНачала
		|				И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &ДатаНачала)
		|			ТОГДА ЕСТЬNULL(ФинансовыеПоказателиНаНачало.Значение, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СЧАНаНачало,
		|	ФинансовыеПоказателиНаНачало.Регистратор КАК РегистраторНаНачало,
		|	ЕСТЬNULL(ФинансовыеПоказателиНаКонец.Значение, 0) КАК СЧАНаКонец,
		|	ФинансовыеПоказателиНаКонец.Регистратор КАК РегистраторНаКонец,
		|	ВЫБОР
		|		КОГДА СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаНачала
		|				И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &ДатаНачала)
		|			ТОГДА СчетаДоверительногоУправления.Ссылка
		|	КОНЕЦ КАК ДоговоровНаНачало,
		|	ВЫБОР
		|		КОГДА СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаОкончания
		|				И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &ДатаОкончания)
		|			ТОГДА СчетаДоверительногоУправления.Ссылка
		|	КОНЕЦ КАК ДоговоровНаКонец,
		|	ВЫБОР
		|		КОГДА СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаНачала
		|				И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &ДатаНачала)
		|			ТОГДА КлиентыНаНачало.Клиент
		|	КОНЕЦ КАК КлиентовНаНачало,
		|	ВЫБОР
		|		КОГДА СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаОкончания
		|				И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &ДатаОкончания)
		|			ТОГДА КлиентыНаКонец.Клиент
		|	КОНЕЦ КАК КлиентовНаКонец
		|ИЗ
		|	_СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели.СрезПоследних(
		|				&ДатаНачала,
		|				Организация = &Организация
		|					И ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)) КАК ФинансовыеПоказателиНаНачало
		|			ЛЕВОЕ СОЕДИНЕНИЕ _Периоды КАК ПериодыНачало
		|			ПО (ПериодыНачало.Период = &ДатаНачала)
		|		ПО (ФинансовыеПоказателиНаНачало.Период МЕЖДУ ПериодыНачало.ПоследнийРабочийДень И &ДатаНачала)
		|			И (ФинансовыеПоказателиНаНачало.СубъектАналитики = СчетаДоверительногоУправления.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)) КАК ФинансовыеПоказателиНаКонец
		|			ЛЕВОЕ СОЕДИНЕНИЕ _Периоды КАК ПериодыКонец
		|			ПО (ПериодыКонец.Период = &ДатаОкончания)
		|		ПО (ФинансовыеПоказателиНаКонец.Период МЕЖДУ ПериодыКонец.ПоследнийРабочийДень И &ДатаОкончания)
		|			И (ФинансовыеПоказателиНаКонец.СубъектАналитики = СчетаДоверительногоУправления.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаНачала, Организация = &Организация) КАК КлиентыНаНачало
		|		ПО СчетаДоверительногоУправления.Ссылка = КлиентыНаНачало.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК КлиентыНаКонец
		|		ПО СчетаДоверительногоУправления.Ссылка = КлиентыНаКонец.СчетДоверительногоУправления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидДоговораДоверительногоУправления,
		|	СчетДоверительногоУправления
		|ИТОГИ
		|	СУММА(СЧАНаНачало),
		|	СУММА(СЧАНаКонец),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДоговоровНаНачало),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДоговоровНаКонец),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КлиентовНаНачало),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КлиентовНаКонец)
		|ПО
		|	ОБЩИЕ,
		|	ВидДоговораДоверительногоУправления
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ЭтотОбъект.Период);
		ЗаполнитьЗначенияСвойств(ОбластьШапкаРасшифровки.Параметры, ЭтотОбъект.Период);
		
		Результат.Вывести(ОбластьШапка);
		Расшифровка.Вывести(ОбластьШапкаРасшифровки);
		
		ВыборкаВидовДоговоров = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаВидовДоговоров.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаВидДоговора.Параметры, ВыборкаВидовДоговоров);
			
			Результат.Вывести(ОбластьСтрокаВидДоговора);
			Расшифровка.Вывести(ОбластьСтрокаВидДоговора);
			Расшифровка.НачатьГруппуСтрок();
			
			ВыборкаСчетовДУ = ВыборкаВидовДоговоров.Выбрать();
			Пока ВыборкаСчетовДУ.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ОбластьСтрокаСчетДУ.Параметры, ВыборкаСчетовДУ);
				Расшифровка.Вывести(ОбластьСтрокаСчетДУ);
			КонецЦикла;
			
			Расшифровка.Вывести(ОбластьПустаяСтрока);
			Расшифровка.ЗакончитьГруппуСтрок();

		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(ОбластьИтог.Параметры, Выборка);
		
		Результат.Вывести(ОбластьИтог);
		Расшифровка.Вывести(ОбластьИтог);
		
		Результат.ФиксацияСверху = 2;
		Расшифровка.ФиксацияСверху = 2;
		
	КонецЦикла;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Функция ПолучитьМассивВидыДоговоровДоверительногоУправления()
	
	МассивВидовДоговоров = Новый Массив;
	
	Для Каждого ЭлементСписка Из ЭтотОбъект.ВидыДоговоровДоверительногоУправления Цикл
		Если ЭлементСписка.Пометка Тогда
			МассивВидовДоговоров.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивВидовДоговоров;
	
КонецФункции
